notes/nov15/nov15.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-07 Thu 19:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Continuation semantics</title>
<meta name="author" content="Julian Grove" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Continuation semantics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga39169c">1. Overview</a></li>
<li><a href="#org1db5e84">2. Interpreting via continuations in Haskell</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga39169c" class="outline-2">
<h2 id="orga39169c"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Starting with <a href="https://members.loria.fr/PdeGroote/papers/amsterdam01.pdf">Philippe de Groote's work</a>, a rich literature in formal semantics
has developed which relies on <a href="https://en.wikipedia.org/wiki/Continuation-passing_style"><i>continuation passing</i></a> to model the
truth-conditional contributions of quantifiers, like <i>some dog</i> and <i>every
linguist</i>. Since de Groote's analysis, most work has focused on what are known
as <i>delimited</i> or <a href="https://link-springer-com.ezp.lib.rochester.edu/article/10.1007/BF01019944"><i>composable</i> continuations</a>; in particular, <a href="https://cb125.github.io/">Chris Barker</a> and
<a href="https://homes.luddy.indiana.edu/ccshan/">Ken Shan</a>'s work (e.g., check out their <a href="https://global.oup.com/academic/product/continuations-and-natural-language-9780199575022?cc=us&amp;lang=en&amp;">2014 book</a>, but also <a href="https://link-springer-com.ezp.lib.rochester.edu/article/10.1023/A:1022183511876">Barker 2003</a> for
something a little shorter). Composable continuations have some fixed result
type, so that the meanings of natural language expressions can be modeled as
functions of type \((α → o) → o\) (for some \(o\)). For example, one can model the
meaning of quantifiers by choosing \(o\) to be \(t\) (the type of extensional
propositions), and assigning, e.g., <i>some dog</i> the interpretation
\[λk.∃x : dog(x) ∧ k(x)\]
which is of type \((e → t) → t\). Meanwhile, other, non-quantificational
expressions can be assigned meanings that use their continuation trivially,
that is, <i>by feeding themselves to it</i>. For example, <i>barks</i> can be assigned the
interpretation
\[λk.k(bark)\]
which is of type \(((e → t) → t) → t\). It takes some continuation of type \((e →
  t) → t\) and feeds it the property \(bark\) (of type \(e → t\)). To compose the
meaning of <i>some dog</i> with the meaning of <i>barks</i>, we may used <i>continuized
(barkward) functional application</i>:<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>
\[⟦\textit{some dog}⟧ ◃ ⟦\textit{barks}⟧ =\]
\[λk.⟦\textit{some dog}⟧(λx.⟦\textit{barks}⟧(λf.k(f(x)))) =\]
\[λk.(λk^\prime.∃y : dog(x) ∧
  k^\prime(y))(λx.(λk^\prime.k^\prime(bark))(λf.k(f(x)))) →_β^*\]
\[λk.(λk^\prime.∃y : dog(y) ∧ k^\prime(y))(λx.k(bark(x))) →_β^*\]
\[λk.∃y : dog(y) ∧ k(bark(y))\]
Having obtained a continuized meaning for the entire sentence, we can <i>lower</i> it
to a value of type \(t\) by feeding it the identity function:
\[(λk.∃y : dog(y) ∧ k(bark(y)))(λb.b) →_β^* ∃y : dog(y) ∧ bark(y)\]
</p>
</div>
</div>

<div id="outline-container-org1db5e84" class="outline-2">
<h2 id="org1db5e84"><span class="section-number-2">2.</span> Interpreting via continuations in Haskell</h2>
<div class="outline-text-2" id="text-2">
<p>
Recall our type family <code>SemType</code>, which takes grammatical categories of
applicative categorial grammar onto types of the λ-calculus:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">type</span> <span style="color: #fb4933;">family</span> <span style="color: #d3869b;">SemType</span> (c <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Cat</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">SemType</span> <span style="color: #d3869b;">NP</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">E</span>
  <span style="color: #d3869b;">SemType</span> <span style="color: #d3869b;">N</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>
  <span style="color: #d3869b;">SemType</span> <span style="color: #d3869b;">S</span> <span style="color: #83a598;">=</span> <span style="color: #d3869b;">T</span>
  <span style="color: #d3869b;">SemType</span> (c1 <span style="color: #d3869b;">:\:</span> c2) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">SemType</span> c1 <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">SemType</span> c2
  <span style="color: #d3869b;">SemType</span> (c2 <span style="color: #d3869b;">:/:</span> c1) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">SemType</span> c1 <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">SemType</span> c2
</pre>
</div>
<p>
In terms of this map, we may implement a function <code>interpExpr</code>, which takes
expressions of English onto λ-terms of <i>continuized</i> types. Rather than map an
expression of category <code>c</code> directly onto its semantic type, we map it onto a
closed term of type <code>(SemType c :-&gt; T) :-&gt; T</code>, using continuized functional
application:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpExpr</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Expr</span> c <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #d3869b;">Empty</span> ((<span style="color: #d3869b;">SemType</span> c <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>) <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
<span style="color: #fabd2f;">interpExpr</span> (<span style="color: #d3869b;">Lex</span> w) <span style="color: #83a598;">=</span> interpWord w
<span style="color: #fabd2f;">interpExpr</span> (<span style="color: #d3869b;">AppL</span> e1 e2) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (weaken (interpExpr e1)) (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (weaken (weaken (interpExpr e2))) (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>) (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))))))))
<span style="color: #fabd2f;">interpExpr</span> (<span style="color: #d3869b;">AppR</span> e1 e2) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (weaken (interpExpr e1)) (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (weaken (weaken (interpExpr e2))) (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>)) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>)))))))
</pre>
</div>
<p>
To interpret individual words (though note that we're considering <i>some dog</i> a
word for our purposes - try to think about what difficulties we encounter if
we try to compose <i>every</i> with <i>dog</i> using our current system), we may write a
function <code>interpWord</code> taking words of some category <code>c</code> onto closed terms of type
<code>(SemType c :-&gt; T) :-&gt; T</code>:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fabd2f;">interpWord</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Word</span> c <span style="color: #83a598;">-&gt;</span> <span style="color: #d3869b;">Term</span> <span style="color: #d3869b;">Empty</span> ((<span style="color: #d3869b;">SemType</span> c <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>) <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"some dog"</span> <span style="color: #d3869b;">IsAnNP</span>) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Exists</span>) (<span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">And</span>) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Dog</span>) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>))) (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Var</span> (<span style="color: #d3869b;">Next</span> <span style="color: #d3869b;">First</span>)) (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>)))))
<span style="color: #fabd2f;">interpWord</span> (<span style="color: #d3869b;">Word</span> <span style="color: #b8bb26;">"barks"</span> (<span style="color: #d3869b;">IsAnNP</span> <span style="color: #d3869b;">::\::</span> <span style="color: #d3869b;">IsAnS</span>)) <span style="color: #83a598;">=</span> <span style="color: #d3869b;">Lam</span> (<span style="color: #d3869b;">App</span> (<span style="color: #d3869b;">Var</span> <span style="color: #d3869b;">First</span>) (<span style="color: #d3869b;">Con</span> <span style="color: #d3869b;">Bark</span>))
</pre>
</div>
<p>
Note that for this to be well typed, our constants should have the following
types:
</p>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #fb4933;">data</span> <span style="color: #d3869b;">Constant</span> (&#966; <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Type</span>) <span style="color: #fb4933;">where</span>
  <span style="color: #d3869b;">Exists</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> ((<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>) <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
  <span style="color: #d3869b;">And</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">T</span> <span style="color: #d3869b;">:-&gt;</span> (<span style="color: #d3869b;">T</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>))
  <span style="color: #d3869b;">Dog</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
  <span style="color: #d3869b;">Bark</span> <span style="color: #83a598;">::</span> <span style="color: #d3869b;">Constant</span> (<span style="color: #d3869b;">E</span> <span style="color: #d3869b;">:-&gt;</span> <span style="color: #d3869b;">T</span>)
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">Note that the forward variant just
switches the binders \(λf\) and \(λx\), i.e.,
\[m ▹ n ≝ λk.m(λf.n(λx.k(f(x))))\]</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Julian Grove</p>
<p class="date">Created: 2023-12-07 Thu 19:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
